app/views/ideas/index.html.erb

                        <p><%=idea.content%></p>
                        <p id="likes" ><%=idea.users_liked.length%> Likes</p>
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 4]]