app/views/users/show.html.erb

          <h5>Email: <%=@user.email%></h5>
          <h6>Total number of posts: <%=@user.ideas.length%></h6>
          <h6>Total number of likes: <%=@user.likes.length%></h6>
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = $1  [["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]